{"config": [{"config": {"name": "flatten_1", "trainable": true, "batch_input_shape": [null, 7, 7, 512], "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activation": "sigmoid", "bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Sequential"}